//
// 演示算数运算符
// canway
//

#include <stdio.h>

int main() {
	
	//-----------------算术运算符-----------------
	
	//1.加法、减法运算
	int a = 10;
	int b = a + 20;
	
	b = a - (15-5);
	
	//2.乘法运算
	int c = 60 - 10 * 5 ;
	
	//3.除法运算,注意精度取舍
	double d = 10 / (double)3;
    int i = 10/3;
    //此时输出3.333333， 3
    printf("double d = 10 / (double)3 = %f, int i = 10/3 = %d\n",d,i);
	
	//4.模运算符(取余)
	int m1 = 5 % 2;  //结果1
	int m2 = 2 % 5;  //结果2
	int m3 = -5 % 2;  //结果-1
	
	//注意：不能对0求余
	//int m4 = 5 % 0;  //错误
	//注意：浮点型不能取余数
	//int m5 = 10.5 % 2;  //错误
	
	
	//5.赋值运算符
	int f1 = 100;
	f1 += 50; //等价于:  f1 = f1 + 50;
	printf("f1 = 100, f1 += 50 = %d\n",f1);
    
    f1 = 100;
    f1 -= 50; //等价于:  f1 = f1 - 50;
    printf("f1 = 100, f1 -= 50 = %d\n",f1);
	
    f1 = 100;
    f1 *= 10;  //等价于： f1 = f1 * 10;
    printf("f1 = 100, f1 *= 50 = %d\n",f1);
	
    f1 = 100;
    f1 /= 10;  //等价于： f1 = f1 / 10;
    printf("f1 = 100, f1 /= 50 = %d\n",f1);
    
    
    f1 = 101;
    f1 %= 10;  //等价于： f1 = f1 % 10;
    //因为要输出%所以，这里用%%
    printf("f1 = 101, f1 %%= 50 = %d\n",f1);
    
	return 0;
	
}