
/*

  测试自增、自减运算
  canway
*/

#include <stdio.h>
#include <stdlib.h>

int main()
{
    //自增、自减运算
    int z1 = 10;
    z1++;   //等价于z1 = z1 + 1;
    printf("z1 = %d \n",z1);
    
    z1--;  //等价于 z1 = z1 - 1;
    
    //常量不能做自增运算
    //5++;  //错误
    //int z2 = 5++;  //错误
    
    //z1++; 与 ++z1 的区别
    //这样单元运算，++放前面或者后面是没有区别的，都是+1
    
    z1++; ++z1;  //在这里是等价的
    
    //下面这个演示，是不等价的
    int i = 0;
    int j = 0;

    //输出结果是 0 1
    printf("i++ = %d, ++j = %d\n", i++, ++j );
    
    //输出结果是 0 1
    printf("i-- = %d, --j = %d\n", i--, --j );
    
    return 0;
}
