//
// 指针的演示
// canway
//

#include <stdio.h>


int main() {
	//声明了一个变量
    int a = 10;
	
	//________________指针的定义________________
	
	//声明一个指针，指向刚才的变量，&是取得变量a的内存地址；
	int *p = &a;
	
	printf("指针指向的地址： %p \n",p);
    printf("指针自身的地址： %p \n",&p);
    printf("指针指向的内存中的值：%d \n",*p);
	
	//________________指针的运算符________________
	//给指针指向的变量赋值
	int y = 10;
	printf("修改前y的值：%d \n",y);
	
    //指针变量p2,指向变量y
	int *p2 = &y;
	
    //此处的*的意思是，表示根据p2中存的内存地址，
	//访问相应的空间，这个空间也就是变量y
	*p2 = 30;
	
	printf("y=%d, *p2=%d \n", y, *p2);
	
	
	//取出指针指向的变量的值
	
	//通过指针地址，访问对应的空间
	int value = *p2;
	printf("取出的值：%d \n",value);
	
	
	return 0;
}